lib/nexmo_developer/app/services/redirector.rb

SELECT "redirects".* FROM "redirects" WHERE "redirects"."url" = $1 ORDER BY "redirects"."id" ASC LIMIT $2  [["url", "/messaging/sms/code-snippets"], ["LIMIT", 1]]
UPDATE "redirects" SET "uses" = COALESCE("uses", 0) + $1 WHERE "redirects"."id" = $2  [["uses", 1], ["id", "5c34135f-8b5b-4b12-8c99-7984f076ac53"]]
---
  def self.find(request)
    url = find_by_config(request) || find_by_environment_redirect(request) # rubocop:disable Rails/DynamicFindBy
    return unless url

    Redirect.where(url: strip_locale_from_path(request.path)).first_or_create.increment!('uses') # rubocop:disable Rails/SkipsModelValidations